# Простые числа
# На вход программе подается два натуральных числа a и b(a < b).
# Напишите программу, которая находит все простые числа от a до b включительно.
#
# Формат входных данных
# На вход программе подаются два числа, каждое на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести все простые числа от a до b включительно, каждое на отдельной строке.
#
# Примечание.
# Число 1 простым не является.
a = int(input())
b = int(input())
for num in range(a, b + 1):
    dividers = 0
    for div in range(1, num +1):
        if num % div == 0:
            dividers += 1
    if dividers == 2:
        print(num)