# What's Your Name?
# Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:
#
# «Hello [введенное имя] [введенная фамилия]! You just delved into Python».
firstName = input()
lastName = input()
print('Hello ' + firstName + ' ' + lastName + '!' + ' You just delved into Python')