# Количество дней
# Дан порядковый номер месяца (1,2,…, 12).
# Напишите программу, которая выводит на экран количество дней в этом месяце. Принять, что год является невисокосным.
#
# Примечание. Постарайтесь написать программу, так чтобы в ней было не более трех условий.
#
# Формат входных данных
# На вход программе подаётся одно целое число – порядковый номер месяца.
#
# Формат выходных данных
# Программа должна вывести количество дней в этом месяце.
numMonth = int(input())
if numMonth == 2:
    print(28)
elif (numMonth % 2 != 0 and 1 <= numMonth <= 7) or (numMonth % 2 == 0 and 8 <= numMonth <= 12):
    print(31)
else:
    print(30)
